package RememberMe;

/*
Коли зліва і справа від присвоєння стоять різні типи даних, справа ЗАВЖДИ відбувається кастінг. Коли справа стоїть
вужчий тип - кастінг відбувається не явно. Коли справа стьїть ширший тип - формується помилка компіляції - потрібен
явній кастінг. Явний кастінг ширшого типу забирає помилку компіляції, але може привести до КАТАСТРОФІЧНОЇ ПОМИЛКИ.
Для примітивів катастрофічна помилка виявляється у обрізанні значення змінної. Для об'єктних змінних КТ виявляється у
поомилці часу ваиконання, RunTimeException. RTE завжди сформуться для ширшого прямого посилання. Для ширшого
ПОЛІМОРФНОГО посилання RTE не сформується ТТТК явний кастінг відбувається до того самого типу, який стоїть справа у
поліморфному посиланні. Помилки при кастінгу не буде також, якщо кастінг робиться до СуперКласа від типу даних,
що стоїть справа у поліморфному посиланні.
*/

public class CastingAndInstanceof  {
}
